GCN(
  (initial_conv): GCNConv(1, 64)
  (conv1): GCNConv(64, 64)
  (conv2): GCNConv(64, 64)
  (conv3): GCNConv(64, 64)
  (out): Linear(in_features=128, out_features=10, bias=True)
)
Number of parameters:  13898
Epoch: 1/10, Training Loss: 2.212, Val Loss: 2.187, Val Accuracy: 20.02%
--------------------
Epoch: 2/10, Training Loss: 2.130, Val Loss: 2.117, Val Accuracy: 22.40%
--------------------
Epoch: 3/10, Training Loss: 2.103, Val Loss: 2.081, Val Accuracy: 23.47%                                                                                                    
--------------------
Epoch: 4/10, Training Loss: 2.071, Val Loss: 2.081, Val Accuracy: 23.16%                                                                                                    
--------------------
Epoch: 5/10, Training Loss: 2.032, Val Loss: 2.012, Val Accuracy: 25.44%                                                                                                    
--------------------
Epoch: 6/10, Training Loss: 1.982, Val Loss: 1.968, Val Accuracy: 27.83%                                                                                                    
--------------------
Epoch: 7/10, Training Loss: 1.943, Val Loss: 1.929, Val Accuracy: 28.55%                                                                                                    
--------------------
Epoch: 8/10, Training Loss: 1.915, Val Loss: 1.904, Val Accuracy: 30.44%                                                                                                    
--------------------
Epoch: 9/10, Training Loss: 1.904, Val Loss: 1.922, Val Accuracy: 29.30%                                                                                                    
--------------------
Epoch: 10/10, Training Loss: 1.893, Val Loss: 1.893, Val Accuracy: 30.32%   